#+TITLE:     HTTP, Node.js and Koa
#+AUTHOR:    Feng Zhou
#+EMAIL:     zf.pascal@gmail.com
#+DATE:      2016-12-02
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+startup: beamer
#+LaTeX_CLASS: beamer
#+latex_header: \mode<beamer>{\usetheme{metropolis}}
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

*** String interpolation

#+BEGIN_SRC javascript :export both
sum = 2
`sum: ${sum}`
#+END_SRC

#+RESULTS:
: sum: 2

*** String interpolation

#+BEGIN_SRC javascript :export both
`sum: ${1 + 1}`
#+END_SRC

#+RESULTS:
: sum: 2

